[
    {
        "title": "The Shawshank Redemption",
        "rating": "9.3",
        "genre": " Drama",
        "synopsis": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency."
    },
    {
        "title": "The Godfather",
        "rating": "9.2",
        "genre": " Crime | Drama",
        "synopsis": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son."
    },
    {
        "title": "Inception",
        "rating": "8.8",
        "genre": " Action | Adventure | Sci-Fi",
        "synopsis": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O."
    },
    {
        "title": "The Matrix",
        "rating": "8.7",
        "genre": " Action | Sci-Fi",
        "synopsis": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers."
    },
    {
        "title": "Interstellar",
        "rating": "8.6",
        "genre": " Adventure | Drama | Sci-Fi",
        "synopsis": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival."
    },
    {
        "title": "Back to the Future",
        "rating": "8.5",
        "genre": " Adventure | Comedy | Sci-Fi",
        "synopsis": "Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, the eccentric scientist Doc Brown."
    },
    {
        "title": "Avengers: Infinity War",
        "rating": "8.5",
        "genre": " Action | Adventure | Sci-Fi",
        "synopsis": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe."
    },
    {
        "title": "Avengers: Endgame",
        "rating": "8.4",
        "genre": " Action | Adventure | Drama",
        "synopsis": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos' actions and restore balance to the universe."
    },
    {
        "title": "The Wolf of Wall Street",
        "rating": "8.2",
        "genre": " Biography | Crime | Drama",
        "synopsis": "Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government."
    },
    {
        "title": "Once Upon a Time... in Hollywood",
        "rating": "7.7",
        "genre": " Comedy | Drama",
        "synopsis": "A faded television actor and his stunt double strive to achieve fame and success in the film industry during the final years of Hollywood's Golden Age in 1969 Los Angeles."
    },
    {
        "title": "Logan",
        "rating": "10",
        "genre": " Action | Drama | Sci-Fi",
        "synopsis": "In a future where mutants are nearly extinct, an elderly and weary Logan leads a quiet life. But when Laura, a mutant child pursued by scientists, comes to him for help, he must get her to safety."
    },
    {
        "title": "Joker",
        "rating": "10",
        "genre": " Crime | Drama | Thriller",
        "synopsis": "In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He then embarks on a downward spiral of revolution and bloody crime. This path brings him face-to-face with his alter-ego: the Joker."
    }
]