[
    {
        "title": "The Hangover",
        "rating": "7.7",
        "genre": " Comedy",
        "synopsis": "Three buddies wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing. They make their way around the city in order to find their friend before his wedding."
    },
    {
        "title": "Superbad",
        "rating": "7.6",
        "genre": " Comedy",
        "synopsis": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry."
    },
    {
        "title": "The 40 Year-Old Virgin",
        "rating": "7.1",
        "genre": " Comedy | Romance",
        "synopsis": "Goaded by his buddies, a nerdy guy who's never \"done the deed\" only finds the pressure mounting when he meets a single mother."
    },
    {
        "title": "22 Jump Street",
        "rating": "7",
        "genre": " Action | Comedy | Crime",
        "synopsis": "After making their way through high school (twice), big changes are in store for officers Schmidt and Jenko when they go deep undercover at a local college."
    },
    {
        "title": "We're the Millers",
        "rating": "7",
        "genre": " Comedy | Crime",
        "synopsis": "A veteran pot dealer creates a fake family as part of his plan to move a huge shipment of weed into the U.S. from Mexico."
    },
    {
        "title": "Ted",
        "rating": "6.9",
        "genre": " Comedy",
        "synopsis": "John Bennett, a man whose childhood wish of bringing his teddy bear to life came true, now must decide between keeping the relationship with the bear or his girlfriend, Lori."
    },
    {
        "title": "Horrible Bosses",
        "rating": "6.9",
        "genre": " Comedy | Crime",
        "synopsis": "Three friends conspire to murder their awful bosses when they realize they are standing in the way of their happiness."
    },
    {
        "title": "Pineapple Express",
        "rating": "6.9",
        "genre": " Action | Comedy | Crime",
        "synopsis": "A process server and his marijuana dealer wind up on the run from hitmen and a corrupt police officer after he witnesses his dealer's boss murder a competitor while trying to serve papers on him."
    },
    {
        "title": "This Is the End",
        "rating": "6.6",
        "genre": " Comedy",
        "synopsis": "Six Los Angeles celebrities are stuck in James Franco's house after a series of devastating events just destroyed the city. Inside, the group not only have to face the apocalypse, but themselves."
    },
    {
        "title": "The Hangover Part II",
        "rating": "6.4",
        "genre": " Comedy",
        "synopsis": "Two years after the bachelor party in Las Vegas, Phil, Stu, Alan, and Doug jet to Thailand for Stu's wedding. Stu's plan for a subdued pre-wedding brunch, however, goes seriously awry."
    },
    {
        "title": "Bad Neighbours",
        "rating": "6.3",
        "genre": " Comedy",
        "synopsis": "After they are forced to live next to a fraternity house, a couple with a newborn baby do whatever they can to take them down."
    },
    {
        "title": "Ted 2",
        "rating": "6.3",
        "genre": " Comedy",
        "synopsis": "Newlywed couple Ted and Tami-Lynn want to have a baby, but in order to qualify to be a parent, Ted will have to prove he's a person in a court of law."
    }
]